; domain
(define (domain satellite)
  (:requirements :typing :fluents :equality)
 (:types satellite direction instrument mode)
 (:predicates 
               (on_board ?i - instrument ?s - satellite)
	       (supports ?i - instrument ?m - mode)
	       (pointing ?s - satellite ?d - direction)
	       (power_avail ?s - satellite)
	       (power_on ?i - instrument)
	       (calibrated ?i - instrument)
	       (have_image ?d - direction ?m - mode)
	       (calibration_target ?i - instrument ?d - direction))
 
 

  (:functions (data_capacity ?s - satellite)
	      (data ?d - direction ?m - mode)
		(slew_time ?a ?b - direction)
		(data-stored)
		(fuel ?s - satellite)
		(fuel-used)
  )

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev)
                   (not (= ?d_new ?d_prev))
		(>= (fuel ?s) (slew_time ?d_new ?d_prev))
              )
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))
		(decrease (fuel ?s) (slew_time ?d_new ?d_prev))
		(increase (fuel-used) (slew_time ?d_new ?d_prev))
           )
  )

 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s)
                 )
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))
           )
          
  )

 
  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
 
   :precondition (and (on_board ?i ?s)
                      (power_on ?i) 
                  )
   :effect (and (not (power_on ?i))
                (power_avail ?s)
           )
  )

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i)
                  )
   :effect (calibrated ?i)
  )
 

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d)
                      (power_on ?i)
			  (>= (data_capacity ?s) (data ?d ?m))
               )
   :effect (and (decrease (data_capacity ?s) (data ?d ?m)) (have_image ?d ?m)
		(increase (data-stored) (data ?d ?m)))
  )
)

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	infrared0 - mode
	thermograph3 - mode
	image1 - mode
	spectrograph2 - mode
	GroundStation0 - direction
	Star2 - direction
	Star3 - direction
	GroundStation4 - direction
	GroundStation1 - direction
	Phenomenon5 - direction
	Phenomenon6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph2)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph2)
	(calibration_target instrument1 GroundStation4)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation0)
	(= (data_capacity satellite0) 1000)
	(= (fuel satellite0) 127)
	(supports instrument3 image1)
	(supports instrument3 infrared0)
	(supports instrument3 thermograph3)
	(calibration_target instrument3 GroundStation1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(= (data_capacity satellite1) 1000)
	(= (fuel satellite1) 151)
	(supports instrument4 spectrograph2)
	(supports instrument4 image1)
	(supports instrument4 thermograph3)
	(calibration_target instrument4 GroundStation1)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon5)
	(= (data_capacity satellite2) 1000)
	(= (fuel satellite2) 158)
	(= (data Phenomenon5 infrared0) 94)
	(= (data Phenomenon6 infrared0) 217)
	(= (data Star7 infrared0) 42)
	(= (data Planet8 infrared0) 28)
	(= (data Planet9 infrared0) 237)
	(= (data Phenomenon5 thermograph3) 242)
	(= (data Phenomenon6 thermograph3) 98)
	(= (data Star7 thermograph3) 38)
	(= (data Planet8 thermograph3) 77)
	(= (data Planet9 thermograph3) 48)
	(= (data Phenomenon5 image1) 270)
	(= (data Phenomenon6 image1) 34)
	(= (data Star7 image1) 294)
	(= (data Planet8 image1) 75)
	(= (data Planet9 image1) 163)
	(= (data Phenomenon5 spectrograph2) 112)
	(= (data Phenomenon6 spectrograph2) 174)
	(= (data Star7 spectrograph2) 11)
	(= (data Planet8 spectrograph2) 273)
	(= (data Planet9 spectrograph2) 276)
	(= (slew_time Star2 GroundStation0) 35.85)
	(= (slew_time GroundStation0 Star2) 35.85)
	(= (slew_time Star2 GroundStation1) 6.299)
	(= (slew_time GroundStation1 Star2) 6.299)
	(= (slew_time Star3 GroundStation0) 60.18)
	(= (slew_time GroundStation0 Star3) 60.18)
	(= (slew_time Star3 GroundStation1) 24.86)
	(= (slew_time GroundStation1 Star3) 24.86)
	(= (slew_time Star3 Star2) 46.01)
	(= (slew_time Star2 Star3) 46.01)
	(= (slew_time GroundStation4 GroundStation0) 27.05)
	(= (slew_time GroundStation0 GroundStation4) 27.05)
	(= (slew_time GroundStation4 GroundStation1) 48.54)
	(= (slew_time GroundStation1 GroundStation4) 48.54)
	(= (slew_time GroundStation4 Star2) 54.18)
	(= (slew_time Star2 GroundStation4) 54.18)
	(= (slew_time GroundStation4 Star3) 11.43)
	(= (slew_time Star3 GroundStation4) 11.43)
	(= (slew_time GroundStation1 GroundStation0) 26.17)
	(= (slew_time GroundStation0 GroundStation1) 26.17)
	(= (slew_time Phenomenon5 GroundStation0) 12.82)
	(= (slew_time GroundStation0 Phenomenon5) 12.82)
	(= (slew_time Phenomenon5 GroundStation1) 3.002)
	(= (slew_time GroundStation1 Phenomenon5) 3.002)
	(= (slew_time Phenomenon5 Star2) 50.98)
	(= (slew_time Star2 Phenomenon5) 50.98)
	(= (slew_time Phenomenon5 Star3) 58.95)
	(= (slew_time Star3 Phenomenon5) 58.95)
	(= (slew_time Phenomenon5 GroundStation4) 22.04)
	(= (slew_time GroundStation4 Phenomenon5) 22.04)
	(= (slew_time Phenomenon6 GroundStation0) 42.82)
	(= (slew_time GroundStation0 Phenomenon6) 42.82)
	(= (slew_time Phenomenon6 GroundStation1) 75.28)
	(= (slew_time GroundStation1 Phenomenon6) 75.28)
	(= (slew_time Phenomenon6 Star2) 29.74)
	(= (slew_time Star2 Phenomenon6) 29.74)
	(= (slew_time Phenomenon6 Star3) 28.28)
	(= (slew_time Star3 Phenomenon6) 28.28)
	(= (slew_time Phenomenon6 GroundStation4) 26.14)
	(= (slew_time GroundStation4 Phenomenon6) 26.14)
	(= (slew_time Phenomenon6 Phenomenon5) 4.291)
	(= (slew_time Phenomenon5 Phenomenon6) 4.291)
	(= (slew_time Star7 GroundStation0) 71.2)
	(= (slew_time GroundStation0 Star7) 71.2)
	(= (slew_time Star7 GroundStation1) 26.32)
	(= (slew_time GroundStation1 Star7) 26.32)
	(= (slew_time Star7 Star2) 18.39)
	(= (slew_time Star2 Star7) 18.39)
	(= (slew_time Star7 Star3) 11.39)
	(= (slew_time Star3 Star7) 11.39)
	(= (slew_time Star7 GroundStation4) 8.323)
	(= (slew_time GroundStation4 Star7) 8.323)
	(= (slew_time Star7 Phenomenon5) 76.04)
	(= (slew_time Phenomenon5 Star7) 76.04)
	(= (slew_time Star7 Phenomenon6) 70.76)
	(= (slew_time Phenomenon6 Star7) 70.76)
	(= (slew_time Planet8 GroundStation0) 28.84)
	(= (slew_time GroundStation0 Planet8) 28.84)
	(= (slew_time Planet8 GroundStation1) 11.98)
	(= (slew_time GroundStation1 Planet8) 11.98)
	(= (slew_time Planet8 Star2) 17.63)
	(= (slew_time Star2 Planet8) 17.63)
	(= (slew_time Planet8 Star3) 12.99)
	(= (slew_time Star3 Planet8) 12.99)
	(= (slew_time Planet8 GroundStation4) 7.255)
	(= (slew_time GroundStation4 Planet8) 7.255)
	(= (slew_time Planet8 Phenomenon5) 10.48)
	(= (slew_time Phenomenon5 Planet8) 10.48)
	(= (slew_time Planet8 Phenomenon6) 16.05)
	(= (slew_time Phenomenon6 Planet8) 16.05)
	(= (slew_time Planet8 Star7) 41.84)
	(= (slew_time Star7 Planet8) 41.84)
	(= (slew_time Planet9 GroundStation0) 34.67)
	(= (slew_time GroundStation0 Planet9) 34.67)
	(= (slew_time Planet9 GroundStation1) 65.58)
	(= (slew_time GroundStation1 Planet9) 65.58)
	(= (slew_time Planet9 Star2) 19.95)
	(= (slew_time Star2 Planet9) 19.95)
	(= (slew_time Planet9 Star3) 28.59)
	(= (slew_time Star3 Planet9) 28.59)
	(= (slew_time Planet9 GroundStation4) 55.34)
	(= (slew_time GroundStation4 Planet9) 55.34)
	(= (slew_time Planet9 Phenomenon5) 57.7)
	(= (slew_time Phenomenon5 Planet9) 57.7)
	(= (slew_time Planet9 Phenomenon6) 43.72)
	(= (slew_time Phenomenon6 Planet9) 43.72)
	(= (slew_time Planet9 Star7) 34.48)
	(= (slew_time Star7 Planet9) 34.48)
	(= (slew_time Planet9 Planet8) 45.12)
	(= (slew_time Planet8 Planet9) 45.12)
	(= (data-stored) 0)
	(= (fuel-used) 0)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(have_image Phenomenon5 spectrograph2)
	(have_image Phenomenon6 thermograph3)
	(have_image Star7 image1)
	(have_image Planet8 thermograph3)
	(have_image Planet9 infrared0)
))
(:metric minimize (fuel-used))

)

; plan
1. (turn_to satellite1 planet9 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 planet9)
   changed: (fuel satellite1) from 151 to 116.33, (fuel-used) from 0 to 34.67
   goals met: 1 of 6
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 6
3. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 158 to 153.709, (fuel-used) from 34.67 to 38.961
   goals met: 1 of 6
4. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 153.709 to 149.418, (fuel-used) from 38.961 to 43.252
   goals met: 1 of 6
5. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 149.418 to 145.127, (fuel-used) from 43.252 to 47.543
   goals met: 1 of 6
6. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 145.127 to 140.836, (fuel-used) from 47.543 to 51.834
   goals met: 1 of 6
7. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 140.836 to 136.545, (fuel-used) from 51.834 to 56.125
   goals met: 1 of 6
8. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 136.545 to 132.254, (fuel-used) from 56.125 to 60.416
   goals met: 1 of 6
9. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 132.254 to 127.963, (fuel-used) from 60.416 to 64.707
   goals met: 1 of 6
10. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 127.963 to 123.672, (fuel-used) from 64.707 to 68.998
   goals met: 1 of 6
11. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 123.672 to 119.381, (fuel-used) from 68.998 to 73.289
   goals met: 1 of 6
12. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 119.381 to 115.09, (fuel-used) from 73.289 to 77.58
   goals met: 1 of 6
13. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 115.09 to 110.799, (fuel-used) from 77.58 to 81.871
   goals met: 1 of 6
14. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 110.799 to 106.508, (fuel-used) from 81.871 to 86.162
   goals met: 1 of 6
15. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 106.508 to 102.217, (fuel-used) from 86.162 to 90.453
   goals met: 1 of 6
16. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 102.217 to 97.926, (fuel-used) from 90.453 to 94.744
   goals met: 1 of 6
17. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 97.926 to 93.635, (fuel-used) from 94.744 to 99.035
   goals met: 1 of 6
18. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 93.635 to 89.344, (fuel-used) from 99.035 to 103.326
   goals met: 1 of 6
19. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 89.344 to 85.053, (fuel-used) from 103.326 to 107.617
   goals met: 1 of 6
20. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 85.053 to 80.762, (fuel-used) from 107.617 to 111.908
   goals met: 1 of 6
21. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 80.762 to 76.471, (fuel-used) from 111.908 to 116.199
   goals met: 1 of 6
22. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 76.471 to 72.18, (fuel-used) from 116.199 to 120.49
   goals met: 1 of 6
23. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 72.18 to 67.889, (fuel-used) from 120.49 to 124.781
   goals met: 1 of 6
24. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 67.889 to 63.598, (fuel-used) from 124.781 to 129.072
   goals met: 1 of 6
25. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 63.598 to 59.307, (fuel-used) from 129.072 to 133.363
   goals met: 1 of 6
26. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 59.307 to 55.016, (fuel-used) from 133.363 to 137.654
   goals met: 1 of 6
27. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 55.016 to 50.725, (fuel-used) from 137.654 to 141.945
   goals met: 1 of 6
28. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 50.725 to 46.434, (fuel-used) from 141.945 to 146.236
   goals met: 1 of 6
29. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 46.434 to 42.143, (fuel-used) from 146.236 to 150.527
   goals met: 1 of 6
30. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 42.143 to 37.852, (fuel-used) from 150.527 to 154.818
   goals met: 1 of 6
31. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 37.852 to 33.561, (fuel-used) from 154.818 to 159.109
   goals met: 1 of 6
32. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 33.561 to 29.27, (fuel-used) from 159.109 to 163.4
   goals met: 1 of 6
33. (turn_to satellite2 phenomenon6 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon6)
   changed: (fuel satellite2) from 29.27 to 24.979, (fuel-used) from 163.4 to 167.691
   goals met: 1 of 6
34. (turn_to satellite2 phenomenon5 phenomenon6)
   deleted: (pointing satellite2 phenomenon6)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 24.979 to 20.688, (fuel-used) from 167.691 to 171.982
   goals met: 1 of 6
35. (turn_to satellite2 groundstation1 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 groundstation1)
   changed: (fuel satellite2) from 20.688 to 17.686, (fuel-used) from 171.982 to 174.984
   goals met: 1 of 6
36. (calibrate satellite2 instrument4 groundstation1)
   added: (calibrated instrument4)
   goals met: 1 of 6
37. (turn_to satellite2 phenomenon5 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon5)
   changed: (fuel satellite2) from 17.686 to 14.684, (fuel-used) from 174.984 to 177.986
   goals met: 1 of 6
38. (take_image satellite2 phenomenon5 instrument4 spectrograph2)
   added: (have_image phenomenon5 spectrograph2)
   changed: (data_capacity satellite2) from 1000 to 888, (data-stored) from 0 to 112
   goals met: 2 of 6
39. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 2 of 6
40. (turn_to satellite1 star2 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 116.33 to 96.38, (fuel-used) from 177.986 to 197.936
   goals met: 2 of 6
41. (turn_to satellite2 planet8 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 planet8)
   changed: (fuel satellite2) from 14.684 to 4.204, (fuel-used) from 197.936 to 208.416
   goals met: 2 of 6
42. (turn_to satellite1 groundstation1 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 96.38 to 90.081, (fuel-used) from 208.416 to 214.715
   goals met: 2 of 6
43. (calibrate satellite1 instrument3 groundstation1)
   added: (calibrated instrument3)
   goals met: 2 of 6
44. (turn_to satellite1 star2 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star2)
   changed: (fuel satellite1) from 90.081 to 83.782, (fuel-used) from 214.715 to 221.014
   goals met: 2 of 6
45. (turn_to satellite1 groundstation1 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 83.782 to 77.483, (fuel-used) from 221.014 to 227.313
   goals met: 2 of 6
46. (turn_to satellite1 phenomenon5 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 77.483 to 74.481, (fuel-used) from 227.313 to 230.315
   goals met: 2 of 6
47. (turn_to satellite1 phenomenon6 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 phenomenon6)
   changed: (fuel satellite1) from 74.481 to 70.19, (fuel-used) from 230.315 to 234.606
   goals met: 2 of 6
48. (take_image satellite1 phenomenon6 instrument3 thermograph3)
   added: (have_image phenomenon6 thermograph3)
   changed: (data_capacity satellite1) from 1000 to 902, (data-stored) from 112 to 210
   goals met: 3 of 6
49. (turn_to satellite1 phenomenon5 phenomenon6)
   deleted: (pointing satellite1 phenomenon6)
   added: (pointing satellite1 phenomenon5)
   changed: (fuel satellite1) from 70.19 to 65.899, (fuel-used) from 234.606 to 238.897
   goals met: 3 of 6
50. (turn_to satellite1 groundstation1 phenomenon5)
   deleted: (pointing satellite1 phenomenon5)
   added: (pointing satellite1 groundstation1)
   changed: (fuel satellite1) from 65.899 to 62.897, (fuel-used) from 238.897 to 241.899
   goals met: 3 of 6
51. (turn_to satellite1 star7 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 star7)
   changed: (fuel satellite1) from 62.897 to 36.577, (fuel-used) from 241.899 to 268.219
   goals met: 3 of 6
52. (take_image satellite1 star7 instrument3 image1)
   added: (have_image star7 image1)
   changed: (data_capacity satellite1) from 902 to 608, (data-stored) from 210 to 504
   goals met: 4 of 6
53. (turn_to satellite1 planet9 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 planet9)
   changed: (fuel satellite1) from 36.577 to 2.097, (fuel-used) from 268.219 to 302.699
   goals met: 4 of 6
54. (take_image satellite2 planet8 instrument4 thermograph3)
   added: (have_image planet8 thermograph3)
   changed: (data_capacity satellite2) from 888 to 811, (data-stored) from 504 to 581
   goals met: 5 of 6
55. (take_image satellite1 planet9 instrument3 infrared0)
   added: (have_image planet9 infrared0)
   changed: (data_capacity satellite1) from 608 to 371, (data-stored) from 581 to 818
   goals met: 6 of 6
